# Shell
brew "fish"
brew "starship"

# Tools
brew "fastfetch"
brew "btop"
brew "bat"
brew "eza"
brew "tree"
brew "fzf"
brew "ripgrep"
brew "yazi"
brew "neovim"
brew "lazygit"
brew "lazydocker"
brew "positng"

# Docker
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima"

# Media
brew "imagemagick"
brew "ffmpeg"
brew "webp"
brew "chafa"
brew "viu"

# Network
brew "wget"
brew "nmap"
brew "mitmproxy"
brew "speedtest-cli"
brew "wgcf"
