# shell
brew "fish"

# tools
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "btop"
brew "tree"
brew "yazi"
brew "neovim"
brew "ripgrep"
brew "posting"
brew "fastfetch"

# languages
brew "php"

# databases
brew "sqlite"
brew "mysql"
brew "postgresql"

# git
brew "lazygit"
brew "git-delta"

# docker
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "colima"
brew "lazydocker"

# media
brew "imagemagick"
brew "ffmpeg"
brew "webp"
brew "chafa"
brew "viu"
brew "youtube-dl"
brew "yt-dlp"

# network
brew "wget"
brew "wgcf"
brew "nmap"
brew "mitmproxy"
brew "speedtest-cli"

# ai agents
brew "claude-code"
brew "codex"
brew "gemini-cli"
brew "copilot-cli"
brew "opencode"
brew "qwen-code"
brew "openclaw-cli"
